Java/datawarehouse/PerformanceScripts/altevv/Performance_AltEVV_Visit_MultiThread_MixAccount_DEV.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.1.1 r1855137">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">D:\workspace\inter-op_payer\datawarehouse\target</stringProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Environment Setting" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="ENV" elementType="Argument">
            <stringProp name="Argument.name">ENV</stringProp>
            <stringProp name="Argument.value">DEV</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="host" elementType="Argument">
            <stringProp name="Argument.name">host</stringProp>
            <stringProp name="Argument.value">${ENV}-api.sandata.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Environment url &quot;qa-api.sandata.com&quot;</stringProp>
          </elementProp>
          <elementProp name="visitPath" elementType="Argument">
            <stringProp name="Argument.name">visitPath</stringProp>
            <stringProp name="Argument.value">/interfaces/intake/visits/rest/api/v1/evv</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="binPath" elementType="Argument">
            <stringProp name="Argument.name">binPath</stringProp>
            <stringProp name="Argument.value">./</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberThread" elementType="Argument">
            <stringProp name="Argument.name">numberThread</stringProp>
            <stringProp name="Argument.value">1</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberRecordPerThread" elementType="Argument">
            <stringProp name="Argument.name">numberRecordPerThread</stringProp>
            <stringProp name="Argument.value">1</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="rampUp" elementType="Argument">
            <stringProp name="Argument.name">rampUp</stringProp>
            <stringProp name="Argument.value">4</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="expected" elementType="Argument">
            <stringProp name="Argument.name">expected</stringProp>
            <stringProp name="Argument.value">false</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="timeOut" elementType="Argument">
            <stringProp name="Argument.name">timeOut</stringProp>
            <stringProp name="Argument.value">5</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="expectedEmployeeRecords" elementType="Argument">
            <stringProp name="Argument.name">expectedEmployeeRecords</stringProp>
            <stringProp name="Argument.value">5000</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="sleep" elementType="Argument">
            <stringProp name="Argument.name">sleep</stringProp>
            <stringProp name="Argument.value">15000</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Data Import" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="employeeBody1" elementType="Argument">
            <stringProp name="Argument.name">employeeBody1</stringProp>
            <stringProp name="Argument.value">${__FileToString(D:\NhonNguyen\Automation\Sandata\inter-op_payer\datawarehouse/PerfAltEvvEmpMEmQTWHRaf_5000.txt,,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="employeeBody2" elementType="Argument">
            <stringProp name="Argument.name">employeeBody2</stringProp>
            <stringProp name="Argument.value">${__FileToString(D:\NhonNguyen\Automation\Sandata\inter-op_payer\datawarehouse/PerfAltEvvEmpUIEjfBxGiO_5000.txt,,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="employeeBody3" elementType="Argument">
            <stringProp name="Argument.name">employeeBody3</stringProp>
            <stringProp name="Argument.value">${__FileToString(D:\NhonNguyen\Automation\Sandata\inter-op_payer\datawarehouse/PerfAltEvvEmpylCxJECeme_5000.txt,,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="employeeBody4" elementType="Argument">
            <stringProp name="Argument.name">employeeBody4</stringProp>
            <stringProp name="Argument.value">${__FileToString(D:\NhonNguyen\Automation\Sandata\inter-op_payer\datawarehouse/PerfAltEvvEmpFVGqJgclAK_5000.txt,,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="employeePrefix1" elementType="Argument">
            <stringProp name="Argument.name">employeePrefix1</stringProp>
            <stringProp name="Argument.value">PerfAltEvvEmpMEmQTWHRaf</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="employeePrefix2" elementType="Argument">
            <stringProp name="Argument.name">employeePrefix2</stringProp>
            <stringProp name="Argument.value">PerfAltEvvEmpUIEjfBxGiO</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="employeePrefix3" elementType="Argument">
            <stringProp name="Argument.name">employeePrefix3</stringProp>
            <stringProp name="Argument.value">PerfAltEvvEmpylCxJECeme</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="employeePrefix4" elementType="Argument">
            <stringProp name="Argument.name">employeePrefix4</stringProp>
            <stringProp name="Argument.value">PerfAltEvvEmpFVGqJgclAK</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection Configuration" enabled="true">
        <boolProp name="autocommit">true</boolProp>
        <stringProp name="checkQuery">select 1 from dual</stringProp>
        <stringProp name="connectionAge">5000</stringProp>
        <stringProp name="dataSource">myDatabase</stringProp>
        <stringProp name="dbUrl">jdbc:oracle:thin:@stx${ENV}db.sandata.com:1526:stx${ENV}</stringProp>
        <stringProp name="driver">oracle.jdbc.OracleDriver</stringProp>
        <boolProp name="keepAlive">true</boolProp>
        <stringProp name="password">Z4ZvTe0DmhdnB1</stringProp>
        <stringProp name="poolMax">1</stringProp>
        <stringProp name="timeout">10000</stringProp>
        <stringProp name="transactionIsolation">DEFAULT</stringProp>
        <stringProp name="trimInterval">60000</stringProp>
        <stringProp name="username">&quot;pallavi.gupta&quot;</stringProp>
      </JDBCDataSource>
      <hashTree/>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="setUp Thread Group" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="[Setup] Initial startId and write to CSV" enabled="true">
          <stringProp name="BeanShellSampler.query">import java.io.FileWriter;
import java.util.Arrays;
import java.io.Writer;
import java.util.List;
import java.text.SimpleDateFormat;
import java.util.Date;
import java.lang.*;

public void writeLine(FileWriter writer, String[] params, char separator) throws IOException {
        boolean firstParam = true;

        StringBuilder stringBuilder = new StringBuilder();
        String param = &quot;&quot;;

        for (int i = 0; i &lt; params.length; i++)
        {
            //get param
		  param = String.format(&quot;%s&quot;,new Object[]{params[i]});

            //if the first param in the line, separator is not needed
            if (!firstParam)
            {
                stringBuilder.append(separator);
            }

            //Add param to line
            stringBuilder.append(param);

            firstParam = false;
        }

        //add to file the line
        writer.write(stringBuilder.toString());
        writer.write(System.lineSeparator());
}

        //Default separator
        char separator = &apos;|&apos;;
        //get path of csv file
        String initialIdCsvFile = &quot;${binPath}${initialIdCsvFileName}&quot;;
        FileWriter fileWriterInitialId = new FileWriter(initialIdCsvFile, false);
	   int numThread = Integer.parseInt(vars.get(&quot;numberThread&quot;));
	   int numRecord = Integer.parseInt(vars.get(&quot;numberRecordPerThread&quot;));
	   int startId = 1;
        //Write header csv
//        String[] headers = {&quot;clientMedicalId&quot;};
//        writeLine(fileWriter, headers, separator);

        //Write body csv
        for (int i = 0; i&lt;numThread; i++){
		  String[] value = {Integer.toString(startId)};
		  startId += numRecord;
            writeLine(fileWriterInitialId, value, separator);
        }

        fileWriterInitialId.flush();
        fileWriterInitialId.close();</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Employee - AltEVV  - PA" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <longProp name="ThreadGroup.start_time">1501264800000</longProp>
        <longProp name="ThreadGroup.end_time">1501351200000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <AuthManager guiclass="AuthPanel" testclass="AuthManager" testname="HTTP Authorization Manager" enabled="true">
          <collectionProp name="AuthManager.auth_list">
            <elementProp name="" elementType="Authorization">
              <stringProp name="Authorization.url">https://{ENV}-api.sandata.com</stringProp>
              <stringProp name="Authorization.username">Sandata@12345</stringProp>
              <stringProp name="Authorization.password">Sandata@12345</stringProp>
            </elementProp>
          </collectionProp>
        </AuthManager>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Account</stringProp>
              <stringProp name="Header.value">392528</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="threadCounter" enabled="true">
          <stringProp name="CounterConfig.start">1</stringProp>
          <stringProp name="CounterConfig.incr">1</stringProp>
          <stringProp name="CounterConfig.name">threadCounter</stringProp>
          <boolProp name="CounterConfig.per_user">false</boolProp>
        </CounterConfig>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="Get Json Body for ${expectedEmployeeRecords} employee with FirstName ${employeePrefix}" enabled="true">
          <stringProp name="BeanShellSampler.query">
//${__counter(FALSE,&quot;globalCounter&quot;)};
log.info(&quot;threadCounter&quot;+vars.get(&quot;threadCounter&quot;));

String currentKey = &quot;employeePrefix&quot;+vars.get(&quot;threadCounter&quot;);
log.info(&quot;Current Key &quot; + currentKey);
String employeePrefix = vars.get(currentKey);
vars.put(&quot;employeePrefix&quot;, employeePrefix);
String employeeBody = vars.get(&quot;employeeBody&quot;+vars.get(&quot;threadCounter&quot;));
log.info(&quot;Read JsonBody from file:&quot; + employeeBody);
vars.put(&quot;employeeBody&quot;, employeeBody);
</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="PA - ImportMultiAccount - MixAccount - AltEvv Import Employee" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${employeeBody}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">dev-api.sandata.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">interfaces/intake/employees/generic.rest/api/v1/evv</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion - Status Success" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1783789965">&quot;status&quot;: &quot;SUCCESS&quot;</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="PA - Verify AltEvv Employee Are Inserted to DB" enabled="true">
          <boolProp name="TransactionController.parent">true</boolProp>
        </TransactionController>
        <hashTree>
          <WhileController guiclass="WhileControllerGui" testclass="WhileController" testname="Verify records insert to DB" enabled="true">
            <stringProp name="WhileController.condition">${__javaScript(vars.get(&quot;expected&quot;)!=&quot;true&quot; &amp;&amp; parseInt(vars.get(&quot;timeOut&quot;))&gt;0)}</stringProp>
          </WhileController>
          <hashTree>
            <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
              <stringProp name="ConstantTimer.delay">${sleep}</stringProp>
            </ConstantTimer>
            <hashTree/>
            <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request" enabled="true">
              <stringProp name="dataSource">myDatabase</stringProp>
              <stringProp name="query">SELECT count(*) as CountNum FROM stx.Workers WHERE F_NAME = &apos;${employeePrefix}&apos;</stringProp>
              <stringProp name="queryType">Select Statement</stringProp>
              <stringProp name="resultSetHandler">Store as Object</stringProp>
              <stringProp name="resultVariable">rsClient</stringProp>
            </JDBCSampler>
            <hashTree>
              <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="Verify existing" enabled="true">
                <boolProp name="resetInterpreter">false</boolProp>
                <stringProp name="script">import java.lang.*;
int expectedEmployeeRecords = Integer.parseInt(vars.get(&quot;expectedEmployeeRecords&quot;));

int timeout = Integer.parseInt(vars.get(&quot;timeOut&quot;));
timeout--;
vars.put(&quot;timeOut&quot;,timeout.toString());

String result = vars.get(&quot;rsClient&quot;);
log.info(&quot;Debug------------&gt;&quot;+result);

String actualEmployeeRecords = result.replace(&quot;[{COUNTNUM=&quot;,&quot;&quot;).replace(&quot;}]&quot;,&quot;&quot;);
log.info(&quot;Debug------------&gt;&quot;+actualMemRecords);
vars.put(&quot;actualEmployeeRecords&quot;,String.valueOf(actualEmployeeRecords));
log.info(&quot;Debug -----------&gt; TimeOut :&quot;+vars.get(&quot;timeOut&quot;) + &quot; / Actual Employee Records :&quot;+actualEmployeeRecords + &quot; should be greater or equal Expected Records :&quot;+vars.get(&quot;expectedEmployeeRecords&quot;));

if(Integer.parseInt(actualEmployeeRecords)&gt;=expectedEmployeeRecords)vars.put(&quot;expected&quot;,&quot;true&quot;);


</stringProp>
              </BeanShellPostProcessor>
              <hashTree/>
            </hashTree>
          </hashTree>
          <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="Verify DB" enabled="true">
            <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
          </BeanShellSampler>
          <hashTree>
            <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="BeanShell Assertion" enabled="true">
              <stringProp name="BeanShellAssertion.query">String expected = vars.get(&quot;expected&quot;);
String errorMesssage = &quot;Debug -----------&gt; Data is not imported fully to DB: &quot; + &quot; / Actual Employee Records :&quot; + vars.get(&quot;actualMemRecords&quot;) + &quot; should be greater or equal Expected Records :&quot;+vars.get(&quot;expectedEmployeeRecords&quot;);
if(expected.equals(&quot;true&quot;)){
		Failure=false;
}
else{
		SampleResult.setResponseCode(&quot;205&quot;);
		Failure=true;
		FailureMessage  = errorMesssage;
    }</stringProp>
              <boolProp name="BeanShellAssertion.resetInterpreter">false</boolProp>
            </BeanShellAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">./TestReport/Import-Visit-SimpleDataWriter-${__time(ddMMyyyy-HHmmss)}.csv</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">/Users/dait/ReportPerformanceEmployee.csv</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>